# კომპიუტერი ინახავს და ამუშავებს სხვადასხვა ტიპის მონაცემებს სხვადასხვა გზით.

# type() ინსტრუქცია გამოიყენება მონაცემთა ტიპის შესამოწმებლად.
print(type(-123))

# ორი int-ის (მთელი რიცხვის) გაყოფა ყოველთვის ქმნის float-ს (ათწილადს).
answer = 6/3
print(type(answer))



# კონვერტაცია - ერთი მონაცემთა ტიპიდან სხვა მონაცემთა ტიპში გადაყვანა

'''                                            CONVERSION TYPES (კონვერტაციის ტიპები)
'''
#                                       IMPLICIT TYPE CONVERSION (იმპლიციტური ტიპის კონვერტაცია)
"""
იმპლიციტური ტიპის კონვერტაციისას პითონი ავტომატურად (მომხმარებლის დახმარების გარეშე) 
გარდაქმნის მონაცემთა ერთ ტიპს სხვა მონაცემთა ტიპად.                               
"""
#                                       EXPLICIT TYPE CONVERSION (ექსპლიციტური კონვერტაცია)                                         
"""
ექსპლიციტური კონვერტაცია გულისხმობს მნიშვნელობის ხელით კონვერტაციის პროცესს მონაცემთა ერთი 
ტიპიდან მეორეზე, ჩაშენებული ფუნქციების გამოყენებით, როგორიცაა int(), float() ან str(). 
მაგ:                                                                                   
(int("23"))
(str(19))                                                                           """

# მათემატიკური ოპერაციები int-სა და float-ს შორის წარმოქმნის float-ს
x = 3
y = 5.0
print(type(x+y))