""" 
ჩვენ შეგვიძლია შევცვალოთ ერთი სახელის მქონე ყველა ცვლადი ერთდროულად,
ამისათვის უნდა მოვნიშნოთ ცვლადი, დავაჭიროთ მაუსის მარჯვენა ღილაკს, ავირჩიოთ "change all occurrences",
შემდეგ დავაჭიროთ კლავიატურაზე მარჯვენა ან მარცხენა ისარს ( --> ; <-- )
და სურვილისამებრ შევცვალოთ ცვლადის სახელი. """

my_name = "Ioane" # ზემოთ ხსენებული მეთოდის გამოყენებით ცვლადის თავდაპირველი სახელი ( name ) შევცვალეთ (my_name).

print(my_name)
print(my_name)
print(my_name)
print(my_name)


# typo - ბეჭდური შეცდომa



#მოცემულია:

animal = "snail"  
print(animal)    

"""                                       chad-ური განმარტება 
დავადეკლარირეთ სტრინგ ტიპის ცვლადი სახელად animal და მივანიჭეთ მნიშვნელობა snail.
გამოვიძახეთ animal ცვლადი და გამოვიტანეთ მისი მნიშვნელობა print ფუნქციით. """

#                                        virgin-ული განმარტება
# დავწერეთ animal უდრის snail-ს და დავპრინტეთ