#                                               CONTROL FLOW
"""
ინსტრუქციების "ნაკადის" გაკონტროლება შესაძლებელია შემდეგი მეთოდების გამოყენებით:
sequencing - კოდების თანმიმდევრობით გაშვება (ზემოდან ქვემოთ).     
iterations (იტერაცია) - გამეორება, ერთი ინსტრუქციის რამოდენიმეჯერ აღსრულება (ასევე უწოდებენ ციკლს (loop)).
selection - არჩევანი, კომპიუტერი კონკრეტული პირობის მიხედვით აკეთებს არჩევანს.                    

ალგორითმი არის საფეხურებად დაყოფილი და გარკვეული თანმიმდევრობით დალაგებული ინსტრუქციათა ერთობლიობა იმის შესახებ,
თუ როგორ უნდა შესრულდეს კონკრეტული დავალება (როგორც რეცეპტი საჭმლის მოსამზადებლად).

არსებობს ალგორითმის წარმოდგენის განსხვავებული მეთოდები:
1) natural language - მარტივად გასაგებია დამწყებებისთვის
2) pseudocode - გამარტივებული ენა, რომელიც ოდნავ წააგავს პროგრამირებას
3) flowchart - დასურათებული დიაგრამა   """