#                                                   FOR LOOP (for ციკლი)
"""
for ციკლი გამოიყენება ერთი და იმავე ინსტრუქციის გარკვეული რაოდენობით განმეორებით შესასრულებლად.

Indentation - ინდენტაცია (კედლისგან tab - ით გამოყოფა)
კოდი, რომლის განმეორებაც ხდება for ციკლში, უნდა იყოს დაწერილი აბზაცით

range()-ის შემდეგ უნდა გამოვიყენოთ :   """

for i in range(3):
  print("Hello")

#                                                 WHILE LOOP (სანამ ციკლი)
"""
while ციკლსაც იგივე ფუნქცია აქვს, მაგრამ ის გამოიყენება მაშინ, როცა არ იცი რამდენჯერ დაგჭირდება ინსტრუქციის განმეორებით შესრულება.

აქაც საჭიროა ინდენტაცია და :   """

tickets = 5                             # (tickets ცვლადი არის counter, ის აღმოფხვრავს infinite loop-ის წარმოქმნას, 
while tickets > 0:                                        # რადგან როცა 15-ვე ბილეთი გაიყიდება იტერაციაც შეწყდება)
  print("sell ticket")
  tickets = tickets - 1