# exclamation mark - ძახილის ნიშანი
# numerical data - რიცხვითი მონაცემები


my_name = "Ioane"   # ცვლადის დეკლარაცია
print(my_name)    # ცვლადის გამოძახება (calling the variable name)

""" 
ცვლადის მნიშვნელობის შეცვლა შესაძლებელია ცვლადის მნიშვნელობის ჩასწორებით, ან იმავე სახელის ცვლადის შექმნით და მისი მნიშვნელობის შეცვლით. 
მაგ: 
"""
number = 33 # შეგვეძლო პირდაპირ აქ ჩაგვესწორებინა ან როგორც ქვემოთაა მოცემული.
number = 3
print(number + 6)  
"""
ცვლადის თავდაპირველი მნიშვნელობის (33) ნაცვლად აღიქმება ცვლადის ბოლო მნიშვნელობა (3) და 39-ის ნაცვლად ვღებულობთ 9-ს.
ამას ეწოდება ცვლადის განახლება (reassigning a variable).
"""